# Rpstr_SetValueInt

## Description
Set an integer value from the VectorScript value repository.

```pascal
PROCEDURE Rpstr_SetValueInt(
				name  : STRING;
				value : INTEGER);
```

```python

def vs.Rpstr_SetValueInt(name, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|value|INTEGER|Set a value associated with the name in the VectorScript value repository.|

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility